w4d3/app/controllers/cats_controller.rb

  def create
    params[:cat][:user_id] = current_user.id
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @cat.update_attributes(cat_params)
---
UPDATE "cats" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = 18  [["description", "gkjdfhgkads"], ["name", "mycat2"], ["updated_at", "2015-07-16 00:27:32.393547"]]