w5d1/app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals" WHERE (user_id = 15 OR privateer = FALSE)
---
  def index
    @goals = Goal.where("user_id = #{current_user.id} OR privateer = FALSE")

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @goal = Goal.find(params[:id])

INSERT INTO "goals" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "You can't bypass the hard drive without indexing the 1080p TCP transmitter!"], ["user_id", 20], ["created_at", "2015-07-20 22:53:58.849043"], ["updated_at", "2015-07-20 22:53:58.849043"]]
---
  def create
    @goal = current_user.goals.new(goal_params)
    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 0]]
---
  def edit
    @goal = Goal.find(params[:id])

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 21]]
UPDATE "goals" SET "privateer" = $1, "completed" = $2, "updated_at" = $3 WHERE "goals"."id" = $4  [["privateer", "t"], ["completed", "f"], ["updated_at", "2015-07-20 22:53:13.918361"], ["id", 4]]
---
  def update
    @goal = Goal.find(params[:id])
    if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 32]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 32]]
---
  def destroy
    goal = Goal.find(params[:id])
    goal.destroy!