w7d4/skeleton/app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    render :json => Feed.all

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render :json => Feed.find(params[:id]), include: :latest_entries

INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 06 Aug 2015 22:18:08 UTC +00:00], ["title", "CNN.com - Top Stories"], ["updated_at", Thu, 06 Aug 2015 22:18:08 UTC +00:00], ["url", "http://rss.cnn.com/rss/cnn_topstories.rss"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://rss.cnn.com/rss/cnn_topstories.rss' LIMIT 1
---
  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def reload
    # Could refactor this into show
    feed = Feed.find(params[:id])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 3]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy